print("Hello, World!")
print(5)


# Python  - это язык программирования (динамический, высокоуроневый, 
# интерпретируемый, с автоматическим управлением памятью)

# Переменные - каробочка которая хранит в себе данные
# Это область в которой харнится ссылка на обьект или же данные в памяти

# a = 5
# b = 10
# c = a + b
# print(c)

# answer1 = int(input("Введите число: "))
# answer2 = int(input("Введите число: "))
# print(answer1 + answer2)

"""Типы данных 
# ====================================================
# Изменяемые
# dict - словарь {key: value} - key должен быть не изменяемым типом данных
# list - список [1, 'hello']
# set - кортеж {1, 2, 3, 'hello'}
# ===================================================
# Не изменяемые
# целое число - int = 1 2 3
# число с плавающей точкой - float = 1.2 3.4
# число с плавающей точкой - decimal = 1.3
# строка - str = '' "" 'hello'
# множество - tuple (1, 2, 3)
# bool - True/False 
"""
# element = 10
# element2 = 10
# element_id = print(id(element))
# element_id = print(id(element2))

# a = [1, 2, 3]
# b = [1, 2, 3]

# print(id(a))
# print(id(b))

name = input("Введите ваше имя: ")
print("Привет", name,"!", "Как твои дела?")
answer = input()
